<a href="https://colab.research.google.com/github/koppula-Sudeep/JupyterNotebook/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
lst = [1,2,3,4,5]
print(lst)

[1, 2, 3, 4, 5]

In [ ]:
series = pd.Series(lst)
print(series)
print(series.dtype)
print(type(series))
print(series.count())
print(series.mean())
print(series.min())
print(series.max())
print(series.median())
print(series.std())
print(series.describe())
print(series.values)
print(series.index)

0    1
1    2
2    3
3    4
4    5
dtype: int64
int64
<class 'pandas.core.series.Series'>
5
3.0
1
5
3.0
1.5811388300841898
count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64
[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

In [ ]:
empty = pd.Series([])
empty

C:\Users\SUDEEP\AppData\Local\Temp\ipykernel_9892\3069909210.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  empty = pd.Series([])

Series([], dtype: float64)

In [ ]:
a = pd.Series(['p','q','r','s','t'], index =[10,11,12,13,14])
a

10    p
11    q
12    r
13    s
14    t
dtype: object

In [ ]:
b = pd.Series(['p','q','r','s','t'], index =[10,11,12,13,14], name = 'alphabets')
b

10    p
11    q
12    r
13    s
14    t
Name: alphabets, dtype: object

In [ ]:
dict_series = pd.Series({'p':[1,4,5], 'q':[2,7,4], 'r':[1,8,4], 's':[0,4,3]})
dict_series

p    [1, 4, 5]
q    [2, 7, 4]
r    [1, 8, 4]
s    [0, 4, 3]
dtype: object

In [ ]:
courses = pd.Series(['java', 'AWS', 'python', 'Golang'])
courses
print(courses.str.upper())
print(courses.str.lower())
print(courses.str.len())
print(courses.str.cat(sep = ','))
print(courses.str.contains('a'))

0      JAVA
1       AWS
2    PYTHON
3    GOLANG
dtype: object
0      java
1       aws
2    python
3    golang
dtype: object
0    4
1    3
2    6
3    6
dtype: int64
java,AWS,python,Golang
0     True
1    False
2    False
3     True
dtype: bool

In [ ]:
import pandas as pd

In [ ]:
pf = pd.DataFrame()
print(pf)

Empty DataFrame
Columns: []
Index: []

In [ ]:
lst = [[1,2,3,4,5],[5,6,7,8,9]]
q = pd.DataFrame(lst)
q

   0  1  2  3  4
0  1  2  3  4  5
1  5  6  7  8  9

In [ ]:
dict = [{'a':1,'b':2,'c':3,'d':4},{'a':5,'b':6,'c':7,'d':8}]#dictionary has key value pair and keys represent column names
w = pd.DataFrame(dict)
w

   a  b  c  d
0  1  2  3  4
1  5  6  7  8

In [ ]:
b = {'Rollno':pd.Series([1,2,3,4,5]),
    'physics':pd.Series([61,62,63,64,65]),
    'maths':pd.Series([71,72,73,74,75])}
e = pd.DataFrame(b)
e

   Rollno  physics  maths
0       1       61     71
1       2       62     72
2       3       63     73
3       4       64     74
4       5       65     75

In [ ]:
df = pd.read_csv(r'C:/Users/SUDEEP/Downloads/data.csv')
df

    firstname  lastname                       email  age
0         Cam     Ingra       Cam.Ingra@outlook.com   40
1       Robbi  Hourigan    Robbi.Hourigan@yahoo.com   50
2      Florie    Pattin   Florie.Pattin@outlook.com   44
3    Cindelyn   Brunell  Cindelyn.Brunell@gmail.com   60
4       Danny   Goldina     Danny.Goldina@yahoo.com   30
..        ...       ...                         ...  ...
992   Julieta   Weinreb   Julieta.Weinreb@yahoo.com   19
993    Danika   Germann  Danika.Germann@outlook.com   24
994    Dorene   Erminia  Dorene.Erminia@outlook.com   34
995   Sidoney   Suzetta   Sidoney.Suzetta@yahoo.com   49
996    Phylis    Dorine   Phylis.Dorine@outlook.com   33

[997 rows x 4 columns]

In [ ]:
df.columns

Index(['firstname', 'lastname', 'email', 'age'], dtype='object')

In [ ]:
df.shape                 # giving (rows,columns)

(997, 4)

In [ ]:
df.size                # number of cells

3988

In [ ]:
df.head()             # first 5 rows

  firstname  lastname                       email  age
0       Cam     Ingra       Cam.Ingra@outlook.com   40
1     Robbi  Hourigan    Robbi.Hourigan@yahoo.com   50
2    Florie    Pattin   Florie.Pattin@outlook.com   44
3  Cindelyn   Brunell  Cindelyn.Brunell@gmail.com   60
4     Danny   Goldina     Danny.Goldina@yahoo.com   30

In [ ]:
df.tail()           # last 5 rows

    firstname lastname                       email  age
992   Julieta  Weinreb   Julieta.Weinreb@yahoo.com   19
993    Danika  Germann  Danika.Germann@outlook.com   24
994    Dorene  Erminia  Dorene.Erminia@outlook.com   34
995   Sidoney  Suzetta   Sidoney.Suzetta@yahoo.com   49
996    Phylis   Dorine   Phylis.Dorine@outlook.com   33

In [ ]:
df.describe()

              age
count  997.000000
mean    39.373119
std     12.536741
min     18.000000
25%     29.000000
50%     39.000000
75%     50.000000
max     60.000000

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 997 entries, 0 to 996
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   firstname  997 non-null    object
 1   lastname   997 non-null    object
 2   email      997 non-null    object
 3   age        997 non-null    int64
dtypes: int64(1), object(3)
memory usage: 31.3+ KB

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 997 entries, 0 to 996
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   firstname  997 non-null    object
 1   lastname   997 non-null    object
 2   email      997 non-null    object
 3   age        997 non-null    int64
dtypes: int64(1), object(3)
memory usage: 31.3+ KB

1. print(score.mean()) # by default it will give the 6 decimal places
2. pd.set_option('display.precision', 2) # it will set to 2 decimal places
3. print(score.T) # it will transpose
4. print(score.sort_index(ascending = False))
5. print(score.sort_index(axis = 1, ascending = False)) #it will sort with column
6. print(score.sort_values(by = 'I1', axis = 1)) # it will sort according to the values in the I1

In [ ]:
import pandas as pd
df = pd.read_csv(r'C:/Users/SUDEEP/Downloads/data.csv')
df

In [ ]:
df.isnull()

In [ ]:
df.isnull().sum()
df.dropna()    # drop all the rows which are consisting null values
               # by default axis = 0 means all rows
               # if axis = 1 means it will check for null values in columns and if columns consists null values then it will remove columns

In [ ]:
df.dropna(how = 'any')        # if any row value is null then remove that row
df.dropna(how = 'all')        # if all row vales are null then remove that row
df.dropna(inplace = True)     # replaces the null values and creates a new DataFrame
df.fillna(0)         # to fill up all the null values with defined integer
df.fillna({'physics':'none','chemistry':30,'maths':65}) # keys are the column name values will replace the null values with the defined interger
df.fillna(method = 'ffill') # ffill is a forward fill
                            # fill the null values with the previous row values
df.fillna(method = 'ffill', axis = 1)  #values of the previous column
df['physics'].fillna(value=df['physics'].mean())
df.fillna(method = 'bfill')

In [ ]:
df.replace(to_replace = 26 , value = 30)
df.replace(34,1000)
df.replace(to_replace=[3,4,5,6,7,8,8,12], value='A')
df.replace(to_replace=[3,4,5,6], value=['A','B','C','D'])

In [ ]:
df['physics'].replace(to_replace=[3,4,5,6], value=['A','B','C','D'], inplace = True)
df.replace('[A-Za-z]',0, regex = True)  #string literals will be replaced by zero